# FormulasFailedForType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FormulasFailedForType Property
BuiltInFailures..::..FamilyFailures Class See Also
---
"Can't satisfy formulas for type [Family Symbol].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FormulasFailedForType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FormulasFailedForType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FormulasFailedForType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace